# ParameterGroup Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExternalDefinition..::..ParameterGroup Property
ExternalDefinition Class See Also
---
Returns the group ID of the parameter definition.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
[ObsoleteAttribute("This property is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the `GetGroupTypeId()` method instead.")]
public override BuiltInParameterGroup ParameterGroup { get; }
```

Visual Basic
---
```text
<ObsoleteAttribute("This property is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the `GetGroupTypeId()` method instead.")> _
Public Overrides ReadOnly Property ParameterGroup As BuiltInParameterGroup
	Get
```

Visual C++
---
```text
[ObsoleteAttribute(L"This property is deprecated in Revit 2024 and may be removed in a future version of Revit. Please use the `GetGroupTypeId()` method instead.")]
public:
virtual property BuiltInParameterGroup ParameterGroup {
	BuiltInParameterGroup get () override;
}
```

# See Also
ExternalDefinition Class
Autodesk.Revit.DB Namespace